Repository: zabbix-jp/translation
Catalog: releasenote/releasenote-omegat.tmx
Source language: en_us
Languages: ja

source: [ZBX-2547] fixed errors in installation
ja: [ZBX-2547] インストール中のエラー(訳注: array_pop()エラー)を修正

source: [ZBX-2914] Gentoo initscript cleanup
ja: [ZBX-2914] Gentoo用のinitscriptをクリーンアップ

source: [ZBX-1605] fixed map with host element under maintenance
ja: [ZBX-1605] メンテナンス中のマップ上のホストのアイコンを修正

source: [ZBX-1607] now trigger line is visible in all Zabbix themes in all states and severity in corresponding severity colour mixed with opposite color which stored in defines in hex
ja: [ZBX-1607] 状態や深刻度に応じて全Zabbixテーマでトリガーの線を可視化、深刻度は16進数で定義されている反対色との混合色で表現

source: [ZBX-3075] fixed a regex bug with zero-length strings
ja: [ZBX-3075] 長さ0の文字列を利用した際の正規表現のバグを修正

source: [ZBXNEXT-196] added "Show with unacknowledged" filter option for triggers screen
ja: [ZBXNEXT-196] トリガー画面にフィルタオプション「障害対応コメントが未入力のみを表示」を追加

source: [ZBX-3481] fixed massAdd for applications
ja: [ZBX-3481] アプリケーションの一括追加処理を修正

source: [ZBX-872] fixed group selected in another section of Hosts affects shown proxy members, and proxies shown in Items host dropdown
ja: [ZBX-872] ホストメニューの他のセクションで選択したグループがプロキシのメンバーの表示に影響を与える問題、およびアイテムのホストドロップダウンにプロキシが表示される問題を修正

source: [ZBX-164] added support of units for values used in notifications
ja: [ZBX-164] 通知に利用する値に単位の機能を追加

source: [ZBX-576] added IPMI authentication algorithms
ja: [ZBX-576] IPMIの認証アルゴリズムを追加

source: [ZBX-1818] changed API version
ja: [ZBX-1818] APIのバージョンを変更

source: [ZBX-916] phrase 'delete selected' replaced by translatable S_DELETE_SELECTED
ja: [ZBX-916] 「delete selected」を翻訳可能な「S_DELETE_SELECTED」に置換え

source: [ZBX-4008] updated Japanese translation; thanks to Kodai Terashima
ja: [ZBX-2492] 日本語翻訳を更新; Kodai Terashimaに感謝

source: [ZBX-3207] fixed possibility to click on web items in trigger expressions
ja: [ZBX-3207] トリガー条件式でWebアイテムをクリックできるように修正

source: [ZBX-2270] fixed item filtering
ja: [ZBX-2270] アイテムのフィルタリングを修正

source: [DEV-438] added support of suffixes (K,M,G) in configuration parameters
ja: [DEV-438] 設定パラメータに接尾辞のK、M、Gのサポートを追加

source: [ZBX-4066] fixed macros saving in administration
ja: [ZBX-4066] 管理設定画面のマクロの保存を修正

source: [ZBX-840] added displaying of text items in the latest data screen
ja: [ZBX-840] 最新データ画面にテキストアイテムの表示を追加

source: [ZBX-1369] make time units translatable in graphs; patch by alixen
ja: [ZBX-1369] alixenのパッチにより、グラフの表示時間の単を翻訳できるように修正

source: ZABBIX SIA is proud to announce the availability of Zabbbix 1.7.2 (alpha).
ja: ZABBIX SIAはZABBIX 1.7.2(alpha)のリリースをアナウンスすることを光栄に思います。

source: [ZBX-862] added support of kernel.maxproc[] under Linux 2.6
ja: [ZBX-862] Linux 2.6でkernel.maxproc[]のサポートを追加

source: [ZBX-1576] fixed evaluating aggregate items for large host groups
ja: [ZBX-1576] 大きなホストグループのアグリゲートアイテムの評価を修正

source: [ZBX-3993] fixed transmitting of templated user macros between server and proxy
ja: [ZBX-3993] サーバとプロキシ間のテンプレートに含まれるユーザマクロの送信を修正

source: [ZBX-3542] reduced the amount of debugging output for configuration cache
ja: [ZBX-3542] 設定キャッシュのデバッグ出力量を削減

source: [ZBX-999] fixed query in availability reports
ja: [ZBX-999] 稼働レポートのクエリを修正

source: Better performance and lower memory usage introduced for many front-end screens.
ja: 多くのWebインターフェースの画面でパフォーマンスの向上とより少ないメモリ使用量を実現しました。

source: [ZBX-2740] fixed js errors in items section in IE
ja: [ZBX-2740] IE利用時のアイテムセクションのjsエラーを修正

source: [ZBX-630] improved log files view in BB theme
ja: [ZBX-630] BBテーマのログファイル表示を改善

source: [ZBX-778] added support of $1..$9 macros in the {ITEM.NAME} macro in notifications
ja: [ZBX-778] 通知用マクロ{ITEM.NAME}に$1..$9のサポートを追加

source: added support of trends_uint
ja: trends_uintのサポートを追加

source: ZABBIX Dashboard provides high level personalized details about the monitored environment.
ja: ダッシュボードは監視している環境の詳細について高度なパーソナライズ機能を提供します。

source: [ZBXNEXT-921] added option to show items without data in latest data
ja: [ZBXNEXT-921] データなしのアイテムを表示するオプションを追加

source: ZABBIX can be installed on any UNIX platform.
ja: ZABBIXはさまざまなUNIXプラットフォームにインストールすることができます。

source: fixed internal loging system
ja: 内部のロギングシステムを修正

source: fixed "System status" cell colors with 0 active triggers
ja: 有効なトリガーが存在しない場合に「システムの状態」のセルの色を修正

source: [ZBX-3947] fixed compilation under AIX 5.2 with fileset lower than 5.2.0.40
ja: [ZBX-3947] 5.2.0.40以前のAIX 5.2環境でコンパイルできるよう修正

source: [ZBX-2423] added custom colour input for link elements
ja: [ZBX-2423] リンク要素にカスタムカラー入力フォームを追加

source: All ZABBIX modules support both IPv4 and IPv6.
ja: すべてのZABBIXモジュールはIPv4とIPv6の両方をサポートします。

source: ZABBIX 1.4 is just around the corner!
ja: ZABBIX 1.4のリリースは目前です!

source: [ZBX-430] improved configuration scripts
ja: [ZBX-430] 設定スクリプトを改善

source: [ZBX-4376] fixed escaping of strings with PostgreSQL 9.1 or later
ja: [ZBX-4376] PostgreSQL 9.1以降の文字列のエスケープ処理を修正

source: [ZBX-2319] fixed escaping locales on download
ja: [ZBX-2319] ダウンロード後のロケールにエスケープ文字が追加される問題を修正

source: [ZBX-118] fixed show_popup_menu display problem
ja: [ZBX-118] ポップアップメニューの表示の問題を修正

source: [ZBX-4159] fixed problem with generating new ids for historical tables
ja: [ZBX-4159] ヒストリテーブル用の新しいidsを生成する際の問題を修正

source: [ZBX-1980] added requirements check for PHP upload_max_filesize
ja: [ZBX-1980] PHPのupload_max_filesizeパラメータの要求チェックを追加

source: [ZBX-1357] fixed confusing date format in network maps
ja: [ZBX-1357] ネットワークマップの紛らわしい日付フォーマットを修正

source: added numeric parameters support for trigger description "$1 $2..$9"
ja: トリガーの名前に引数"$1 $2 .. $9"の機能を追加

source: Graph legend can be optionally disabled.
ja: グラフの凡例をオプションで無効にすることができます。

source: Complete List of Improvements and Bug Fixes included into 1.8.4
ja: 1.8.4に含まれるバグフィックスと改善の一覧

source: [ZBX-536] fixed problem with "Unable to add performance counter"
ja: [ZBX-536] "Unable to add performance counter"の問題を修正

source: Automatic filling of DNS name for discovered devices
ja: ディスカバリで自動検出されたデバイスのDNS名の自動補完

source: [ZBX-4205] fixed trigger status change not logged in audit for inherited triggers
ja: [ZBX-4205] 継承されたトリガーのステータス変更が監査ログに記録されない問題を修正

source: This is the second BETA release in a series of pre-1.8 releases.
ja: このリリースは1.8の開発版の2つ目のベータリリースです。

source: The login screen was re-designed to have a better look.
ja: ログイン画面を再設計し見た目を改善しました。

source: Better Distributed Monitoring
ja: 分散モニタリングの改善

source: [ZBX-645] after new installation, filter for audit log is set not to filter anything
ja: [ZBX-645] 新規インストール後、監査ログのフィルタを何もフィルタしないように設定

source: Existing ICMP monitoring was enhanced to support more detailed statistics including number of lost packets and min/max/avg timing.
ja: ICMP監視機能が拡張され、ロストパケットや最小/最大/平均レスポンスタイムなどより詳細な監視を行うことができるようになりました。

source: [ZBX-2275] fixed loss of the log-data if Zabbix server is unavailable
ja: [ZBX-2275] Zabbixサーバが利用できない場合にログデータが喪失する問題を修正

source: [ZBX-927] removed default values for text and blob fields in the upgrade script for compatibility with MySQL 5.0
ja: [ZBX-927] MySQL5.0との互換性のためのアップグレードスクリプトのテキストとBLOBフィールドのデフォルト値を削除

source: Centralized configuration allows all the nodes to be configured from a single location easily.
ja: 設定の中央管理を行うことで、一つの場所から簡単にすべてのノードの設定を行うことができます。

source: [ZBX-2507] minimal graph dimension size is set to 20 pixels
ja: [ZBX-2507] グラフの最小サイズを20ピクセルに設定

source: [ZBX-2777] fixed map labels when "status only" option is set
ja: [ZBX-2777] 「ステータスのみ」を設定したときのマップのラベルを修正

source: [ZBX-3107] fixed graph bugs: problem with large values, problem with uptime format
ja: [ZBX-3107] グラフのバグ修正: 大きな値を利用した場合の問題とuptimeのフォーマットの問題

source: ZABBIX can be used in mixed or IPv6 only environments.
ja: ZABBIXは混在またはIPv6のみの環境で利用することができます。

source: Added support of auto-discovery by IP range and TCP services.
ja: IPレンジとTCPサービスによるオートディスカバリのサポートを追加

source: The scripts are executed on a local ZABBIX server or one of ZABBIX nodes.
ja: スクリプトはローカルのZABBIXサーバまたはZABBIXノードの一つで実行されます。

source: [ZBX-1746] fixed problems viewing map element
ja: [ZBX-1746] マップの項目の表示の問題を修正

source: Calculated items make possible creation of virtual items based on arithmetical expressions.
ja: 計算アイテムは算術式による仮想的なアイテムを作成することができます。

source: Added param NOEMPTY for popup page witch allows hide Empty button in application and item pages
ja: アプリケーションとアイテムのページ内で空ボタンを隠すのを許可するポップアップのためにNOEMPTYパラメータを追加

source: [ZBX-1627] fixed errors in monitoring->overview
ja: [ZBX-1627] モニタリング -> 概要のエラーを修正

source: Support of SQLite3 for use on server-side
ja: サーバ側のSQLite3サポート

source: [ZBX-3856] fixed new group creation from template page
ja: [ZBX-3856] テンプレートページから新しいグループを作成した場合の問題を修正

source: [ZBX-633] fixed server crash on disconnected IPMI devices
ja: [ZBX-633] 接続できないIPMIデバイスが存在する場合にサーバがクラッシュする問題を修正

source: [ZBXNEXT-323] improved bad performance of the trends for large number of items
ja: [ZBXNEXT-323] 多数のアイテムが存在する場合のトレンドのパフォーマンスを改善

source: [ZBX-4352] fixed template linking when mass updating hosts
ja: [ZBX-4352] ホストの一括更新時のテンプレートのリンク処理を修正

source: Added support of monitoring auto-registered hosts with passive checks.
ja: パッシブチェックによる監視対象ホストの自動登録機能を追加しました。

source: [ZBX-2312] fixed event order in "monitoring triggers" and "last 20 events"
ja: [ZBX-2312] 「監視データ - トリガー」と「最新20件のイベント」画面のイベントの表示順を修正

source: Support of visible host and template name
ja: ホストとテンプレートの表示名を追加

source: [ZBX-2789] forbid active agent items to have 0 interval
ja: [ZBX-2789] アクティブエージェントのアイテムの更新間隔を0に設定できないように修正

source: This release fixes numerous issues of Zabbix 1.8.5 and introduces new interesting functionality.
ja: このリリースにはZabbix 1.8.5のいくつかの修正と新機能の紹介が含まれます。

source: No dependency on Sqlora8 library anymore.
ja: Sqlora8ライブラリへの依存は無くなりました。

source: A nice overview of the new functionality is at http://www.zabbix.com/documentation/1.8/manual/about/what_s_new_1.8.10.
ja: 新機能の概要はhttp://www.zabbix.com/documentation/1.8/manual/about/what_s_new_1.8.10から参照することができます。

source: [ZBX-2172] fixed object available scripts sorting alphabetically
ja: [ZBX-2172] 利用できるスクリプトをアルファベット順に並び替えるように修正

source: [ZBX-2904] fixed some unknown triggers not shown in status of triggers screen
ja: [ZBX-2904] いくつかの不明な状態のトリガーがトリガー画面で表示されない問題を修正

source: [ZBX-1465] fixed adding hostgroup elements on map
ja: [ZBX-1465] マップにホストグループのアイコンを追加できるように修正

source: [ZBX-137] added new indexes for tables: httptest, httptest, actions, dhosts, dservices, escalations
ja: [ZBX-137] httptest、httptest、actions、dhosts、dservices、escalationsの各テーブルに新しいインデックスを追加

source: Zabbix SIA is proud to announce the availability of Zabbix 1.9.0 (First Alpha Release of Zabbix 2.0).
ja: Zabbix SIAはZabbix 1.9.0 (Zabbix 2.0の最初のアルファリリース)のリリースをアナウンスすることを光栄に思います。

source: More efficient communication with agents
ja: より効率的なエージェントとの通信

source: [ZBX-1772] changed frontend timezone to match PHP server
ja: [ZBX-1772] PHPサーバに合わせてフロントエンドのタイムゾーンを変更

source: [ZBX-360] fixed possible warning messages under Oracle while updating items
ja: [ZBX-360] Oracleを使用している場合に、アイテムの更新時にワーニングメッセージが出力される可能性がある問題を修正

source: It is recommended to create the following indexes in order to speed up performance of ZABBIX front-end as well as server side:
ja: ZABBIX Webインターフェースのパフォーマンス改善のためにサーバ上で次のインデックスを作成することを推奨します。

source: [ZBX-2466] fixed item filter form
ja: [ZBX-2466] アイテムフィルタのフォームを修正

source: added support of DisablePassive parameter for agent
ja: エージェントの設定にDisablePassiveパラメータを追加

source: This document contains the release notes for Zabbix 1.8.3rc2.
ja: このドキュメントはZabbix 1.8rc2のリリースノートを含みます。

source: This document contains the release notes for Zabbix 1.8.3rc1.
ja: このドキュメントはZabbix 1.8.3rc1のリリースノートを含みます。

source: New templates
ja: 新しいテンプレート

source: [ZBX-2791] fixed host menu in "top 100 triggers" in ie7
ja: [ZBX-2791] IE7利用時の「障害発生数上位100項目」画面のホストメニューを修正

source: The development work was sponsored by XS4ALL, the best ISP in the Netherlands!
ja: この開発はオランダのISPである XS4ALL の協力によって行われました。

source: [ZBX-4135] fixed item selection in trigger expression editor
ja: [ZBX-4135] トリガー条件式作成フォームのアイテムの選択を修正

source: [ZBX-2406] removed filter from plaintext history
ja: [ZBX-2406] ヒストリのプレーンテキスト画面からフィルタを削除

source: [ZBX-107] do not display log related items in the queue
ja: [ZBX-107] キューに入っているアイテムに関するログを表示しないように修正

source: [ZBX-3211] updated Ukrainian translation; renamed locale to uk_ua; thanks to zalex_ua
ja: [ZBX-3211] ウクライナ語翻訳を更新; ロケールの名前をuk_uaに変更; zalex_uaに感謝

source: [ZBX-1675] fixed map element coordinates do not update after the element has been dragged
ja: [ZBX-1675] マップのアイコンのドラッグ後にアイコンの座標が更新されない問題を修正

source: Traceroute and Ping can be executed from a number of screens.
ja: いくつかの画面から、TracerouteとPingを実行することができます。

source: [ZBX-1302] fixed references to missing items.nextcheck in the GUI
ja: [ZBX-1302] GUIでitem.nextcheckが見つからない問題のためにリファレンスを修正

source: [ZBX-1284] fixed server crash if using zabbix[queue] check without dbcache
ja: [ZBX-1284] データベースキャッシュを利用しない状態でzabbix[queue]チェックを利用した場合にサーバがクラッシュする問題を修正

source: [ZBX-1031] added more security checks for communication between nodes.
ja: [ZBX-1031] ノード間の通信により多くのセキュリティチェックを追加。

source: Support of negative data
ja: マイナスのデータをサポート

source: [ZBX-573] made SQL optimization for PGSQL
ja: [ZBX-573] PGSQLのためにSQLを最適化

source: [ZBX-1324] replaced user visible string ZABBIX with Zabbix
ja: [ZBX-1324] ZABBIXと表示されている文字をZabbixに置き換え

source: [ZBX-2942] increased minimum interval for ICMP pings to 20 ms; thanks to nelsonab
ja: [ZBX-2942] ICMP pingの最小更新間隔を20msに延長; nelsonabに感謝

source: [DEV-457] improved dashboard favourite selection
ja: [DEV-457] ダッシュボードのお気に入り選択を改善

source: New form for configuration of actions
ja: アクション設定の新しいフォーム

source: fixed zabbix server status when frontend and backend are on different servers
ja: フロントエンドとバックエンドが異なるサーバ上にある場合のZABBIXサーバのステータスを修正

source: Zabbix is able to discover your file systems, network interfaces and SNMP interfaces automatically with no manual work.
ja: 手動で設定を行わなくても、Zabbixはファイルシステムやネットワークインターフェース、SNMPインターフェースを自動的に検知します。

source: No Oracle patches for migration from 1.4 exist yet.
ja: 1.4から移行するためのOracleのパッチはまだ存在しません。

source: fixed minor GUI text errors
ja: マイナーなGUIのテキストエラーを修正

source: [DEV-411] improved performance of trends module
ja: [DEV-411] トレンドモジュールのパフォーマンスを改善

source: [ZBX-1663] fixed y axis calculation in stacked graphs
ja: [ZBX-1663] 積算グラフのY軸の計算を修正

source: Support of bulk acknowledgements
ja: より大量の認知をサポート

source: What's New
ja: 変更点

source: It is highly recommended to upgrade from earlier ZABBIX 1.4.x.
ja: これまでのZABBIX 1.4.xリリースからアップグレードすることを強く推奨します。

source: [ZBX-2467] added more command line arguments to objdump to request more debugging information about crashes
ja: [ZBX-2467] クラッシュに関するデバッグ情報取得のobjdumpにコマンドライン引数を追加

source: added support of source ip address for all binaries
ja: 全てのバイナリにソースIPアドレスのサポートを追加

source: [DEV-137] poller will continue processing of other items after enabling a host
ja: [DEV-137] ホストの有効後にpollerが他のアイテムの処理を継続するように修正

source: [ZBX-896] improved performance of processing of IT services.
ja: [ZBX-896] ITサービスの処理のパフォーマンスを改善

source: Better time navigation
ja: タイムナビゲーションの改善

source: With the feature freeze this release provides functionality that will be available later in Zabbix 1.8.
ja: このリリースはZABBIX 1.8以降で利用できる機能を提供し、フィーチャーフリーズを含みます。

source: What's New in 1.7.x (beta)
ja: ZABBIX 1.7.x (beta)の変更点

source: [DEV-273] added mass update for IPMI fields
ja: [DEV-273] 一括更新にIPMIフィールドを追加

source: [ZBX-886] removed duplicate and outdated strings from locales
ja: [ZBX-886] 重複している古いロケール文字列の削除

source: Number of SQL queries generated by the server has been decreased very much.
ja: サーバによって発行されるSQLクエリの数も大幅に削減しています。

source: [ZBX-3548] added IPV6_V6ONLY flag (where defined) for binding IPv4 and IPv6 interfaces separately
ja: [ZBX-3548] IPv4とIPv6インターフェースが個別にバインドされている場合に使用できる(定義済みの)IPV6_V6ONLYフラグを追加

source: [ZBX-1400] changed none working time highlight color for default graph themes
ja: [ZBX-1400] デフォルトのグラフ表示テーマでワーキングタイム以外ののハイライト色を変更

source: It is recommended to create the following indexes in order to speed up performance of ZABBIX front-end as well as server side (ignore it if the indexes already exist):
ja: ZABBIX Webインターフェースのパフォーマンス改善のためにサーバ上で次のインデックスを作成することを推奨します。(インデックスがすでに存在している場合を除く)

source: [ZBX-2136] fixed handling of logitems with logtimefmt in db cache
ja: [ZBX-2136] dbキャッシュ内のlogtimefmtを用いたログアイテムの処理に関する問題を修正

source: [ZBX-812] fixed Windows agent crash when using incorrect third parameter in proc_info metric
ja: [ZBX-812] proc_infoに誤った3番目の引数を指定した場合にWindowsのエージェントがクラッシュする問題を修正

source: [ZBX-2561] refactored usergroups api, improved items deletion
ja: [ZBX-2561] ユーザグループのAPIを再作成し、アイテムの削除を改善

source: [DEV-274] added overflow check for uint64 for incoming values
ja: [DEV-274] unit64の入力値に対するオーバーフローチェックの追加

source: [ZBX-1427] fixed adding Actions through API
ja: [ZBX-1427] APIによるアクションの追加を修正

source: [ZBXNEXT-816] added support for reloading configuration cache from the command line
ja: [ZBXNEXT-816] コマンドラインから設定情報のキャッシュ再読み込み機能を追加

source: [ZBX-4424] fixed handling of a localized content with incorrect utf8 characters
ja: [ZBX-4424] 正しくないUTF-8文字列を含むローカライズされたコンテンツの処理を修正

source: [DEV-397] added notification macros {EVENT.ACK.STATUS} and {EVENT.ACK.HISTORY}
ja: [DEV-397] 通知用マクロ{EVENT.ACK.STATUS}と{EVENT.ACK.HISTORY}を追加

source: [ZBX-1355] fixed possible server crash when receiving invalid data.
ja: [ZBX-1355] 誤ったデータ受信時にサーバがクラッシュする可能性がある問題を修正。

source: [ZBX-987] fixed shutting down server/proxy after connection lost to remote mysql server
ja: [ZBX-987] リモートのMySQLサーバへの接続が失われた場合にサーバ/プロキシが停止する問題を修正

source: The Dashboard provides high level personalized details about monitored environment.
ja: ダッシュボードは監視している環境の詳細について高度なパーソナライズ機能を提供します。

source: improved not supported values processing
ja: サポートされていない値の処理を改善

source: [ZBX-1628] removed templates from status of triggers screen
ja: [ZBX-1628] トリガーのステータス画面からテンプレートを削除

source: corrected some typos in test/env/standalone/conf/template_server.conf
ja: test/env/standalone/conf/template_server.confのいくつかの表記間違いを修正

source: Support of calculated items
ja: アイテムの計算のサポート

source: [ZBX-2851] fixed apache hanging when frontend connects to empty database
ja: [ZBX-2851] Webインターフェースから空のデータベースにアクセスした際にApacheが固まってしまう問題を修正

source: [ZBX-1345] time filter redesigned, sliders moved to top inside filter
ja: [ZBX-1345] 時間のフィルタのデザインを見直し、スライダーを上部のフィルタ内に移動

source: added hosts mass update functionality
ja: ホストの一括更新機能を追加

source: [ZBX-2290] added export/import of map images
ja: [ZBX-2290] マップイメージのエクスポート/インポートを追加

source: [ZBX-109] added support of vm.memory.size[pfree] Linux, FreeBSD & Win agents
ja: [ZBX-109] Linux、FreeBSD、Windows用エージェントにアイテムvm.memory.size[pfree]を追加

source: [ZBX-1931] fixed process of sending active checks to ensure every active item is located in the server cache
ja: [ZBX-1931] すべてのアクティブアイテムがサーバキャッシュ内に保存されたことを保証するためにアクティブチェックの送信書エイを修正

source: Added required server performance info to Status of ZABBIX
ja: ZABBIXサーバのステータス画面に要求されるサーバのパフォーマンス情報を追加

source: Zabbix API documentation was massively improved.
ja: Zabbix APIのドキュメントを大幅に改善しました。

source: [ZBX-464] fixed user creation under ldap
ja: [ZBX-464] LDAP利用時のユーザ作成の問題を修正

source: It works for Oracle, PostgreSQL and MySQL.
ja: Oracle、PostgreSQL、MySQLで動作します。

source: Japanese translation was improved.
ja: 日本語の翻訳ファイルが更新されました。

source: [ZBX-2825] fix after saving the profile it stays in the profile page
ja: [ZBX-2825] プロファイル保存後にプロファイル画面のままであった問題を修正

source: [ZBX-1690] fixed undefined index when creating action with name that already exists
ja: [ZBX-1690] 既に存在している名前のアクションを作成した場合にインデックスが定義されない問題を修正

source: [ZBX-2163] fixed possibility to acknowledge events regardless of GUI events settings
ja: [ZBX-2163] GUIのイベント画面で設定したいるにも関わらず対応済のイベントが表示される可能性を修正

source: [ZBX-1425] option ALL is added to host group dropdown when adding or editing host group
ja: [ZBX-1425] ホストグループの追加と編集時のホストグループのドロップダウンに「全て」のオプションを追加

source: Hosts with installed Zabbix agents can be automatically added for monitoring.
ja: Zabbixエージェントがインストールされたホストを自動的に監視対象として登録することができます。

source: edited configure.in file to make some error messages more sensible
ja: configure.inファイルのいくつかのエラーメッセージをより分かりやすく修正

source: This document contains the release notes for Zabbix 1.8.9rc1.
ja: このドキュメントはZabbix 1.8.9rc1のリリースノートを含みます。

source: [ZBX-3351] fixed broken support of 1.4.x style configuration file format for WEB interface
ja: [ZBX-3351] Webインターフェイスが1.4.xスタイルの設定ファイル形式をサポートできない問題を修正

source: [ZBX-821] fixed dashboard context menu "Latest data" does not show required host
ja: [ZBX-821] ダッシュボードの「最新データ」コンテキストメニューが要求したホストを表示しない問題を修正

source: [ZBX-2029] fixed monitoring triggers showing triggers with true dependencies
ja: [ZBX-2029] トリガーのステータス画面で親トリガーが障害の場合にも依存するトリガーが表示される問題を修正

source: [ZBX-2336] fixed 'system.hostname' being empty on Windows hosts with names longer than 15 characters
ja: [ZBX-2336] 15文字以上の名前をもつWindowsホスト上で「system.hostname」が空白になる問題を修正

source: [ZBX-2252] fixed server crash and infinite looping in telnet checks
ja: [ZBX-2252] telnetチェックにおけるサーバクラッシュと無限ループを修正

source: [ZBXNEXT-138] our daemons can now listen on multiple IPs, see ListenIP configuration parameter
ja: [ZBXNEXT-138] 複数IPアドレスでListenできるように修正。詳細はListenIP設定パラメータを参照

source: It is strongly recommended to upgrade from ZABIX 1.4 and 1.4.1.
ja: このリリースはZABIX 1.4、1.4.1からアップグレードすることを強く推奨します。

source: Network maps improvements
ja: ネットワークマップの改善

source: [ZBX-1853] fixed template/host full clone with triggers with dependencies
ja: [ZBX-1853] 依存関係を持つトリガーが設定されているテンプレート/ホストの複製処理を修正

source: [DEV-330] extended template trigger dependencies functionality
ja: [DEV-330] テンプレートのトリガー依存関係機能の拡張

source: The release supports MySQL and SQLite only.
ja: このリリースではMySQLとSQLiteのみサポートされます。

source: [ZBX-2417] fixed timeout handling for passive checks on agent side
ja: [ZBX-2417] エージェントのパッシブチェックのタイムアウト処理を修正

source: [ZBX-612] fixed possible incorrect value for host
ja: [ZBX-612] ホストに間違った値が設定される可能性がある問題を修正

source: fixed filtering of items by status
ja: ステータスによるアイテムのフィルタリングを修正

source: [ZBX-926] fixed exporting after preview
ja: [ZBX-926] プレビュー後のエクスポートを修正

source: [ZBX-2861] fixed error when adding users to usergroups
ja: [ZBX-2861] ユーザをユーザグループに追加する際のエラーを修正

source: [ZBX-167] fixed typo in triggers update function
ja: [ZBX-167] トリガーアップデート関数のtypoを修正

source: [ZBX-2907] fixed errors when action condition has trigger from another node
ja: [ZBX-2907] 別のノードのトリガーを利用してアクションのコンディションを設定する際のエラーを修正

source: [ZBX-4052] fixed key macros resolving in item names
ja: [ZBX-4052] アイテム名内のキーのマクロの処理を修正

source: [ZBX-2757] fixed calendar colors in DO theme
ja: [ZBX-2757] Dark Orangeテーマのカレンダーの色を修正

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8, new major version of Zabbix.
ja: Zabbix SIAはZabbixの新しいメジャーバージョンZabbix 1.8のリリースをアナウンスすることを光栄に思います。

source: [ZBX-154] fixed processing of comma in zbx.fs.size[]
ja: [ZBX-154] zbx.fs.size[]中のカンマの処理を修正

source: Database cache module can be enabled to improve performance of busy ZABBIX servers.
ja: データベースキャッシュモジュールは負荷の高いZABBIXサーバのパフォーマンスを改善することができます。

source: [ZBX-3908] allow empty string for formula field if multiplier is switched off
ja: [ZBX-3908] 乗数の設定が無効の場合に乗数の式のフィールドに空白文字列を許可するように修正

source: [ZBX-220] fixed agent crash in case of timeout during first connect
ja: [ZBX-220] 初回接続時にタイムアウトした場合、エージェントがクラッシュする問題を修正

source: [ZBX-2532] fixed outdated information in "server info" screen element
ja: [ZBX-2532] "サーバ情報"画面に古い情報が表示される問題を修正

source: [ZBX-3206] fixed timeout for simple checks (removed hardcoded timeout 3 sec)
ja: [ZBX-3206] シンプルチェックのタイムアウト処理を修正(ハードコードしていた3秒のタイムアウトを削除)

source: [ZBX-1957] fixed compilation errors under OpenBSD
ja: [ZBX-1957] OpenBSD上のコンパイルエラーを修正

source: Recompile ZABBIX binaries and update front-end PHP files, no database patching needed.
ja: ZABBIXのバイナリのリコンパイルとフロントエンドPHPファイルのアップデートを行う必要があります。データベースへのパッチ適用を行う必要はありません。

source: [ZBX-67] fixed synchronization of binary data between nodes under PostgresSQL
ja: [ZBX-67] PostgreSQLを利用した場合のノード間のバイナリデータの同期を修正

source: A nice overview of the new features is at http://www.zabbix.com/documentation/1.8/manual/about/what_s_new_1.8.7.
ja: 新機能の概要はhttp://www.zabbix.com/documentation/1.8/manual/about/what_s_new_1.8.7から参照することができます。
